posts/meson/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " lang="zh_cn">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>meson | chimez's blog</title>
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<link href="../../assets/css/ipython.min.css" rel="stylesheet" type="text/css">
<link href="../../assets/css/nikola_ipython.css" rel="stylesheet" type="text/css">
<link href="https://fonts.googleapis.com/css?family=Playfair+Display:700,900" rel="stylesheet">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" hreflang="zh_cn" href="../../rss.xml">
<link rel="canonical" href="https://chimez.github.io/posts/meson/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="chimez">
<link rel="prev" href="../lapack/" title="LAPACK" type="text/html">
<link rel="next" href="../rust-optimization/" title="Rust Optimization" type="text/html">
<meta property="og:site_name" content="chimez's blog">
<meta property="og:title" content="meson">
<meta property="og:url" content="https://chimez.github.io/posts/meson/">
<meta property="og:description" content="meson 构建工具


网站 meson-build




配置示例

   cc = meson.get_compiler('c')

   all_deps = []
   thread_dep = dependency('threads')
   all_deps += thread_dep

   src_dir = include_directories('../src')

   ">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2021-05-10T16:20:05+08:00">
<meta property="article:tag" content="C">
<meta property="article:tag" content="meson">
</head>
<body>
<a href="#content" class="sr-only sr-only-focusable">跳到主内容</a>

<!-- Header and menu bar -->
<div class="container">
      <header class="blog-header py-3"><div class="row nbb-header align-items-center">
          <div class="col-md-3 col-xs-2 col-sm-2" style="width: auto;">
            <button class="navbar-toggler navbar-light bg-light nbb-navbar-toggler" type="button" data-toggle="collapse" data-target=".bs-nav-collapsible" aria-controls="bs-navbar" aria-expanded="false" aria-label="Toggle navigation">
                <span class="navbar-toggler-icon"></span>
            </button>
            <div class="collapse bs-nav-collapsible bootblog4-search-form-holder">
                
            </div>
        </div>
          <div class="col-md-6 col-xs-10 col-sm-10 bootblog4-brand" style="width: auto;">
            <a class="navbar-brand blog-header-logo text-dark" href="../../">

            <span id="blog-title">chimez's blog</span>
        </a>
          </div>
            <div class="col-md-3 justify-content-end align-items-center bs-nav-collapsible collapse flex-collapse bootblog4-right-nav">
            <nav class="navbar navbar-light bg-white"><ul class="navbar-nav bootblog4-right-nav">
<li class="nav-item">
    <a href="index.org" id="sourcelink" class="nav-link">源文件</a>
    </li>


                    
            </ul></nav>
</div>
    </div>
</header><nav class="navbar navbar-expand-md navbar-light bg-white static-top"><div class="collapse navbar-collapse bs-nav-collapsible" id="bs-navbar">
            <ul class="navbar-nav nav-fill d-flex w-100">
<li class="nav-item">
<a href="../../archive.html" class="nav-link">Archive</a>
                </li>
<li class="nav-item">
<a href="../../categories/" class="nav-link">Tags</a>
                </li>
<li class="nav-item">
<a href="../../rss.xml" class="nav-link">RSS feed</a>

                
            </li>
</ul>
</div>
<!-- /.navbar-collapse -->
</nav>
</div>

<div class="container" id="content" role="main">
    <div class="body-content">
        <!--Body content-->
        
        
        
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="." class="u-url">meson</a></h1>

        <div class="metadata">
            <p class="byline author vcard p-author h-card"><span class="byline-name fn p-name" itemprop="author">
                    chimez
            </span></p>
            <p class="dateline">
            <a href="." rel="bookmark">
            <time class="published dt-published" datetime="2021-05-10T16:20:05+08:00" itemprop="datePublished" title="2021-05-10 16:20">2021-05-10 16:20</time></a>
            </p>
            
        <p class="sourceline"><a href="index.org" class="sourcelink">源文件</a></p>

        </div>
        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <div id="outline-container-org8c9611e" class="outline-2">
<h2 id="org8c9611e">meson 构建工具</h2>
<div class="outline-text-2" id="text-org8c9611e">
<p>
网站 <a href="https://mesonbuild.com">meson-build</a>
</p>
</div>

<div id="outline-container-orgbc1eb5e" class="outline-3">
<h3 id="orgbc1eb5e">配置示例</h3>
<div class="outline-text-3" id="text-orgbc1eb5e">
<div class="highlight"><pre><span></span>   <span class="n">cc</span> <span class="o">=</span> <span class="n">meson</span><span class="o">.</span><span class="n">get_compiler</span><span class="p">(</span><span class="s1">'c'</span><span class="p">)</span>

   <span class="n">all_deps</span> <span class="o">=</span> <span class="p">[]</span>
   <span class="n">thread_dep</span> <span class="o">=</span> <span class="n">dependency</span><span class="p">(</span><span class="s1">'threads'</span><span class="p">)</span>
   <span class="n">all_deps</span> <span class="o">+=</span> <span class="n">thread_dep</span>

   <span class="n">src_dir</span> <span class="o">=</span> <span class="n">include_directories</span><span class="p">(</span><span class="s1">'../src'</span><span class="p">)</span>

   <span class="n">exe</span> <span class="o">=</span> <span class="n">executable</span><span class="p">(</span><span class="s1">'name'</span><span class="p">,</span> <span class="p">[</span><span class="s1">'src1.c'</span><span class="p">,</span> <span class="s1">'src2.c'</span><span class="p">],</span>
           <span class="n">dependencies</span><span class="p">:</span> <span class="n">all_deps</span><span class="p">,</span> 
           <span class="n">include_directories</span><span class="p">:</span> <span class="n">src_dir</span><span class="p">)</span>
</pre></div>
</div>
</div>

<div id="outline-container-org2b20b2c" class="outline-3">
<h3 id="org2b20b2c">使用 address sanitizer</h3>
<div class="outline-text-3" id="text-org2b20b2c">
<div class="highlight"><pre><span></span>   CC=clang meson build  -Db_sanitize=address -Db_lundef=false
</pre></div>
</div>
</div>

<div id="outline-container-org0702d0b" class="outline-3">
<h3 id="org0702d0b">使用 clang 静态分析</h3>
<div class="outline-text-3" id="text-org0702d0b">
<div class="highlight"><pre><span></span>   meson build
   ninja -C build scan-build
</pre></div>
</div>
</div>

<div id="outline-container-orgce981cc" class="outline-3">
<h3 id="orgce981cc">自定义外部依赖</h3>
<div class="outline-text-3" id="text-orgce981cc">
<p>
参考 <a href="https://mesonbuild.com/Dependencies.html#declaring-your-own">Manual/Dependencies</a>
</p>

<p>
一个外部依赖只需要知道头文件和链接库(静态/动态)
</p>
<div class="highlight"><pre><span></span>   <span class="n">my_inc</span> <span class="o">=</span> <span class="n">include_directories</span><span class="p">(</span><span class="o">...</span><span class="p">)</span>
   <span class="n">my_lib</span> <span class="o">=</span> <span class="n">static_library</span><span class="p">(</span><span class="o">...</span><span class="p">)</span>
   <span class="n">my_dep</span> <span class="o">=</span> <span class="n">declare_dependency</span><span class="p">(</span><span class="n">link_with</span> <span class="p">:</span> <span class="n">my_lib</span><span class="p">,</span>
                               <span class="n">include_directories</span> <span class="p">:</span> <span class="n">my_inc</span><span class="p">)</span>
</pre></div>
</div>

<div id="outline-container-org3982c56" class="outline-4">
<h4 id="org3982c56">将依赖做子目录</h4>
<div class="outline-text-4" id="text-org3982c56">
<p>
首先在子目录中放入依赖的源码，并且在其中定义子项目的 <code>meson.build</code> 文件
</p>
<div class="highlight"><pre><span></span>    <span class="n">foo_dep</span> <span class="o">=</span> <span class="n">declare_dependency</span><span class="p">(</span><span class="o">...</span><span class="p">)</span>
</pre></div>

<p>
之后就可以在主项目中依赖它
</p>
<div class="highlight"><pre><span></span>    <span class="n">foo_dep</span> <span class="o">=</span> <span class="n">dependency</span><span class="p">(</span><span class="s1">'foo'</span><span class="p">,</span> <span class="n">fallback</span> <span class="p">:</span> <span class="p">[</span><span class="s1">'foo'</span><span class="p">,</span> <span class="s1">'foo_dep'</span><span class="p">])</span>
</pre></div>
</div>
</div>
</div>

<div id="outline-container-orgb79138a" class="outline-3">
<h3 id="orgb79138a">子项目</h3>
<div class="outline-text-3" id="text-orgb79138a">
<p>
<a href="https://mesonbuild.com/Subprojects.html">https://mesonbuild.com/Subprojects.html</a>
</p>
</div>

<div id="outline-container-org65a2398" class="outline-4">
<h4 id="org65a2398">从子项目获取依赖</h4>
<div class="outline-text-4" id="text-org65a2398">
<div class="highlight"><pre><span></span><span class="n">libsimple_proj</span> <span class="o">=</span> <span class="n">subproject</span><span class="p">(</span><span class="s1">'libsimple'</span><span class="p">)</span>
<span class="n">libsimple_dep</span> <span class="o">=</span> <span class="n">libsimple_proj</span><span class="o">.</span><span class="n">get_variable</span><span class="p">(</span><span class="s1">'libsimple_dep'</span><span class="p">)</span>
</pre></div>
</div>
</div>
</div>

<div id="outline-container-orgae28770" class="outline-3">
<h3 id="orgae28770">使用 wrap 管理依赖</h3>
<div class="outline-text-3" id="text-orgae28770">
<p>
在 <code>subprojects</code> 文件夹中创建 <code>libfoobar.wrap</code> 文件, 其中指定源码位置 <code>[wrap-file]</code> 和提供的依赖 <code>[provide]</code> ，格式参考 <a href="https://mesonbuild.com/Wrap-dependency-system-manual.html">这里</a>
</p>

<p>
对于非 meson-build 项目，还需要一个 <code>meson.build</code> 文件来添加支持，这个额外的文件称作 <code>patch</code>, 这个额外配置文件可以从网络中下载获取(通过 <code>patch_url</code>, 参考<a href="https://mesonbuild.com/Wrap-dependency-system-manual.html#accepted-configuration-properties-for-wraps">这里</a>)
</p>

<p>
示例 <code>subprojects/cache2.wrap</code> ：
</p>
<div class="highlight"><pre><span></span>   <span class="p">[</span><span class="n">wrap</span><span class="o">-</span><span class="n">file</span><span class="p">]</span>
   <span class="n">directory</span> <span class="o">=</span> <span class="n">Catch2</span><span class="o">-</span><span class="mf">2.13.3</span>
   <span class="n">source_url</span> <span class="o">=</span> <span class="n">https</span><span class="p">:</span><span class="o">//</span><span class="n">github</span><span class="o">.</span><span class="n">com</span><span class="o">/</span><span class="n">catchorg</span><span class="o">/</span><span class="n">Catch2</span><span class="o">/</span><span class="n">archive</span><span class="o">/</span><span class="n">v2</span><span class="mf">.13.3</span><span class="o">.</span><span class="n">zip</span>
   <span class="n">source_filename</span> <span class="o">=</span> <span class="n">Catch2</span><span class="o">-</span><span class="mf">2.13.3</span><span class="o">.</span><span class="n">zip</span>
   <span class="n">source_hash</span> <span class="o">=</span> <span class="mi">1804</span><span class="n">feb72bc15c0856b4a43aa586c661af9c3685a75973b6a8fc0b950c7cfd13</span>
   <span class="n">patch_directory</span> <span class="o">=</span> <span class="n">catch2</span>

   <span class="p">[</span><span class="n">provide</span><span class="p">]</span>
   <span class="n">catch2</span> <span class="o">=</span> <span class="n">catch2_dep</span>
</pre></div>


<p>
自己编写的配置文件应该放在 <code>subprojects/packagefiles/libfoobar/meson.build</code> 中，并设置 <code>patch_directory</code>
</p>

<p>
示例 <code>subprojects/packagefiles/cache2/meson.build</code> ：
</p>
<div class="highlight"><pre><span></span>   <span class="n">project</span><span class="p">(</span><span class="s1">'catch2'</span><span class="p">,</span>
       <span class="s1">'cpp'</span><span class="p">,</span>
       <span class="n">version</span> <span class="p">:</span> <span class="s1">'2.13.3'</span><span class="p">,</span>
       <span class="n">license</span> <span class="p">:</span> <span class="s1">'Boost'</span>
   <span class="p">)</span>

   <span class="n">catch2_dep</span> <span class="o">=</span> <span class="n">declare_dependency</span><span class="p">(</span>
       <span class="n">include_directories</span> <span class="p">:</span> <span class="n">include_directories</span><span class="p">(</span><span class="s1">'single_include'</span><span class="p">)</span>
   <span class="p">)</span>
</pre></div>
</div>
</div>
</div>
    </div>
    <aside class="postpromonav"><nav><ul itemprop="keywords" class="tags">
<li><a class="tag p-category" href="../../categories/c/" rel="tag">C</a></li>
            <li><a class="tag p-category" href="../../categories/meson/" rel="tag">meson</a></li>
        </ul>
<ul class="pager hidden-print">
<li class="previous">
                <a href="../lapack/" rel="prev" title="LAPACK">上一篇文章</a>
            </li>
            <li class="next">
                <a href="../rust-optimization/" rel="next" title="Rust Optimization">下一篇文章</a>
            </li>
        </ul></nav></aside></article><!--End of body content--><footer id="footer">
            Contents © 2023         <a href="mailto:chimez@163.com">chimez</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         
            
            
        </footer>
</div>
</div>


        <script src="../../assets/js/all-nocdn.js"></script><script>
    baguetteBox.run('div#content', {
        ignoreClass: 'islink',
        captions: function(element){var i=element.getElementsByTagName('img')[0];return i===undefined?'':i.alt;}});
    </script>
</body>
</html>
